Revit 2027 API
ConduitSizes.GetConduitSizesIterator Method
 Returns a ConduitSizeIterator to the conduit sizes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConduitSizeIterator GetConduitSizesIterator()
Public Function GetConduitSizesIterator As ConduitSizeIterator
public:
ConduitSizeIterator^ GetConduitSizesIterator()
member GetConduitSizesIterator : unit -> ConduitSizeIterator
Return Value
ConduitSizeIterator
See Also
Reference
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace